t = \
[
    "Часто, в крупных компаниях для разработки элементов различных систем",
    "привлекаются как разработчики (разных уровней и направлений), так и подрядные",
    "организации. Такое большое количество людей, даже в условиях существования",
    "единых правил оформления, стиля, наличия naming и structure conditions, приводит",
    "к существенному увеличению количества времени, затрачиваемого на проверку и",
    "корректировку создаваемых merge requests. Зачастую, корректировка занимает даже",
    "больше времени, чем написание кода в самом MR.",
    "однослово"
]

t2 = \
[
    "это какой-то текст, а тут реализовано 12+5",
    "а дальше 14-9",
    "затем 3+5 хочу",
    "потооооом пупупу 9-100 пусть будет",
    "где-то дальше 60+8",
    "а там уже и утро, сделано 400+20 задач",
    "как-то так",
    "-9 +5"
]
