"""
Лабораторная работа №2 'Написание алгоритмов с выбором условий'
Артамонов Аркадий ИУ7-16Б
Задание 3

Программа для определения принадлежности точки (x, y)
к заданной области (учитывая границы)
"""


# 0. Определение ф-ии проверки
def check(x: float, y: float) -> bool:
    """Проверяет принадлежность точки к области"""
    if y >= 0:
        if x > 9:
            return False
        if x >= 8:
            return (y >= (7 * (x - 8)**2 + 1)) and ((-1/8 * (x - 9)**2 + 8) >= y)
        elif x >= 1 and x <= 8:
            if ((1/49 * (x - 1)**2) <= y) and ((-1/8 * (x - 9)**2 + 8) >= y):
                return True
            else:
                return y == 1.5*(x) + 2
        elif x >= 0 and x <= 1:
            return (y == 1.5*(x) + 2) or ((y >= (4 * x**2 - 6)) and (y <= (-4 * x**2 + 2)))
    else:
        if x > 8:
            return False
        if x >= 2:
            return (y >= (1/3 * (x - 5)**2 - 7)) and (y <= (-1/16 * x**2))
        elif x >= 1:
            return (y >= (-2 * (x - 1)**2 - 2)) and (y <= (-1/16 * x**2))
        elif x >= 0 and x <= 1:
            return (y >= (4 * x**2 - 6)) and (y <= (-4 * x**2 + 2))
    return False


# 1. Запуск программы, ввод координат точки, вывод ответа
if __name__ == '__main__':
    x = abs(float(input('Введите x: ')))
    y = float(input('Введите y: '))

    if check(x, y):
        print('Точка принадлежит')
    else:
        print('Точка не принадлежит')
